// Напишите программу, которая принимает на вход трёхзначное число и на выходе показывает последнюю цифру этого числа. 456 -> 6 782 -> 2 918 -> 8
Console.Clear();

int a = new Random().Next(1,10);
Console.Write(a);

int b = new Random().Next(1,10);
Console.Write(b);

int c = new Random().Next(1,10);
Console.WriteLine(c);

    Console.Write("Последняя цифра в числе = ");
    Console.Write(c);
