// Напишите программу, которая на вход принимает число и выдаёт его квадрат (число умноженное на само себя).
int numberA = new Random().Next(1,10);

int result = numberA * numberA;
Console.Write("квадрат числа ");
Console.Write(numberA);
Console.Write(" = ");
Console.WriteLine(result);
